web/src/taskpane/taskpanes.html

<!DOCTYPE html>
<html>
<head>
    <title>Outlook Email Viewer</title>
    <script type="text/javascript" src="https://appsforoffice.microsoft.com/lib/1/hosted/office.js"></script>
    <script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/jquery/3.6.0/jquery.min.js"></script>
    <script type="text/javascript" src="https://cdnjs.cloudflare.com/ajax/libs/axios/0.25.0/axios.min.js"></script>
</head>
<body>
<div id="emailsList">
    <!-- Email messages will be displayed here -->
</div>

<script type="text/javascript">
        Office.onReady(function (info) {
            if (info.host === Office.HostType.Mailbox) {
                // Initialize your add-in here for Outlook Mailbox
                $(document).ready(function () {
                    $('#ViewEmailsButton').click(function () {
                        fetchEmails();
                    });
                });
            }
        });

        function fetchEmails() {
            Office.context.mailbox.makeEwsRequestAsync(
                getEmailsRequest,
                function (asyncResult) {
                    if (asyncResult.status === 'succeeded') {
                        var response = asyncResult.value;
                        var parser = new DOMParser();
                        var xmlDoc = parser.parseFromString(response, 'text/xml');
                        var emails = xmlDoc.getElementsByTagName('t:Message');

                        var emailsList = document.getElementById('emailsList');
                        emailsList.innerHTML = '';

                        for (var i = 0; i < emails.length; i++) {
                            var subject = emails[i].getElementsByTagName('t:Subject')[0].textContent;
                            var sender = emails[i].getElementsByTagName('t:From')[0].getElementsByTagName('t:Mailbox')[0].getElementsByTagName('t:Name')[0].textContent;
                            var emailItem = document.createElement('div');
                            emailItem.innerHTML = '<strong>From:</strong> ' + sender + '<br><strong>Subject:</strong> ' + subject + '<br><br>';
                            emailsList.appendChild(emailItem);
                        }
                    } else {
                        console.error('Failed to fetch emails: ' + asyncResult.error.message);
                    }
                }
            );
        }

        var getEmailsRequest =
            '<?xml version="1.0" encoding="utf-8"?>' +
            '<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">' +
            '  <soap:Header>' +
            '    <t:RequestServerVersion Version="Exchange2016" />' +
            '  </soap:Header>' +
            '  <soap:Body>' +
            '    <FindItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" Traversal="Shallow">' +
            '      <ItemShape>' +
            '        <t:BaseShape>Default</t:BaseShape>' +
            '        <t:AdditionalProperties>' +
            '          <t:FieldURI FieldURI="item:Subject" />' +
            '          <t:FieldURI FieldURI="item:From" />' +
            '        </t:AdditionalProperties>' +
            '      </ItemShape>' +
            '      <ParentFolderIds>' +
            '        <t:FolderId Id="inbox" />' +
            '      </ParentFolderIds>' +
            '    </FindItem>' +
            '  </soap:Body>' +
            '</soap:Envelope>';
    </script>
</body>
</html>
